app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
    @company = @project.company
    @users = @company.users
    @projects = @company.projects.where("id != #{params[:id]}").limit(4)
    @feeds = Feed.where("company_id = #{@company.id}").limit(4)
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = NULL LIMIT 1
SELECT  `projects`.* FROM `projects` WHERE (company_id = 1 && id != 1) LIMIT 4
SELECT  `feeds`.* FROM `feeds` WHERE (company_id = 1) LIMIT 4